backend/__tests__/carga/load.test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Warm up"
    - duration: 60
      arrivalRate: 10
      name: "Ramp up"
    - duration: 30
      arrivalRate: 10
      name: "Sustained load"
  payload:
    path: "./test-data.csv"
    fields:
      - "email"
      - "password"

scenarios:
  - name: "Login concurrente"
    weight: 40
    flow:
      - post:
          url: "/api/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          expect:
            - statusCode: 200
          capture:
            - json: "$.success"
              as: "loginSuccess"

  - name: "Registro masivo vehículos"
    weight: 30
    flow:
      - post:
          url: "/api/ingreso"
          json:
            placa: "LOAD{{ $randomString(4) }}"
            id_tipo_vehiculo: 23
            email: "{{ email }}"
          expect:
            - statusCode: [200, 400]
          capture:
            - json: "$.success"
              as: "ingresoSuccess"

  - name: "Consultas dashboard"
    weight: 30
    flow:
      - get:
          url: "/api/reporte-ocupacion/{{ email }}"
          expect:
            - statusCode: 200
            - contentType: json
          capture:
            - json: "$.estacionamiento.nombre"
              as: "estacionamientoNombre"